Revit 2024 API
ElementSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ElementSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ElementSetIterator
Visual C++
public:
virtual ElementSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
ElementSet Class
Autodesk.Revit.DB Namespace